kurella-saikumar/eStar_InstrumentCluster/eStar_Cluster_Demo/STM32CubeIDE/Application/User/Core/src/Service/Memory_Service/eeprom_emul/eeprom_emulation/eeprom_emul.c
    /* Reset global variables */
    usNbWrittenElements = (uint16_t)0U;
    ucCurrentActivePage = START_PAGE;
    ulAddressNextWrite = PAGE_HEADER_SIZE; /* Initialize write position just after page header */

 return EE_OK;
}



/**
  * @brief  Returns the last stored variable data, if found, which correspond to
  *         the passed virtual address
  * @param VirtAddress Variable virtual address on 32 bits (can't be 0x00000000 or 0xFFFFFFFF)
  * @param  pData Variable containing the 32bits read variable value
  * @retval EE_Status
  *           - EE_OK: if variable was found
  *           - EE error code: if an error occurs
  */
EE_Status xEE_ReadVariable32bits(uint32_t VirtAddress, uint32_t* pData)
{
  	if((VirtAddress != 0x00000000) && (VirtAddress != 0xFFFFFFFF))
  	{
		EE_DATA_TYPE uldatatmp = 0U;
		EE_Status status = EE_OK;

		/* Read variable of size EE_DATA_TYPE, then cast it to 32bits */
		status = prvReadVariable(VirtAddress, &uldatatmp);
		*pData = uldatatmp;

		return status;
  	}
	else
	{
		return EE_INVALID_VIRTUALADDRESS;
	}
}



/**
  * @brief  Writes/updates variable data in EEPROM.
  *         Trig internal Pages transfer if half of the pages are full.
  * @warning This function is not reentrant
  * @param VirtAddress Variable virtual address on 16 bits (can't be 0x0000 or 0xFFFF)
  * @param  Data 32bits data to be written
  * @retval EE_Status
  *           - EE_OK: on success
  *           - prvEE_CleanUp_REQUIRED: success and user has to trig flash pages cleanup
  *           - EE error code: if an error occurs
  */
EE_Status xEE_WriteVariable32bits(uint32_t VirtAddress, uint32_t Data)
{
	if((VirtAddress != 0x00000000) && (VirtAddress != 0xFFFFFFFF))
	{
		return prvWriteVariable(VirtAddress, (EE_DATA_TYPE) Data);
	}
	else
	{
		return EE_INVALID_VIRTUALADDRESS;
	}
}



/**
  * @brief  Get page state in page header
  * @param  Address Address of the FLASH Memory page
  * @retval State State of the page
  */

 EE_State_type prvGetPageState(uint32_t Address)
{

    uint8_t ucHeader_Data[4][EE_HEADER_ELEMENT_SIZE] = {0x00};
    EE_ELEMENT_TYPE status[4] = {0x00};

    // Read the specified number of header elements
    if (HAL_OK != xFI_Read(Address, &ucHeader_Data[0][0], 4 * EE_HEADER_ELEMENT_SIZE))
    {
        return HAL_ERROR;
    }

    // Process the data to determine page state
    for (int i = 0; i < 4; i++)
    {
        for (int j = (EE_HEADER_ELEMENT_SIZE - 1); j >= 0; j--)
        {
            status[i] |= ((uint64_t)ucHeader_Data[i][j] << (8 * j));
        }
    }
    /* Return erasing status, if element4 is not EE_PAGESTAT_ERASED value */
	if (status[3] != EE_PAGESTAT_ERASED)
	{
		return STATE_PAGE_ERASING;
	}	

	/* Return valid status, if element3 is not EE_PAGESTAT_ERASED value */
	if (status[2] != EE_PAGESTAT_ERASED)
	{
		return STATE_PAGE_VALID;
	}

	/* Return active status, if element2 is not EE_PAGESTAT_ERASED value */
	if (status[1] != EE_PAGESTAT_ERASED)
	{
		return STATE_PAGE_ACTIVE;
	}

	/* Return receive status, if element1 is not EE_PAGESTAT_ERASED value */
	if (status[0] != EE_PAGESTAT_ERASED)
	{
		return STATE_PAGE_RECEIVE;
	}

	/* Return erased status, if 4 first elements are EE_PAGESTAT_ERASED value */
	return STATE_PAGE_ERASED;
}

/**
  * @brief  Set page state in page header
  * @param  Page Index of the page
  * @param  State State of the page
  * @retval EE_Status
  *           - EE_OK: on success
  *           - EE error code: if an error occurs
  */
 EE_Status prvSetPageState(uint32_t Page, EE_State_type State)
{
  uint8_t ucReceive[EE_HEADER_ELEMENT_SIZE]  = {0xAA,0xAA,0xAA,0xAA,0xAA,0xAA,0xAA,0xAA};
  uint8_t ucActive [EE_HEADER_ELEMENT_SIZE]  = {0xAA,0xAA,0xAA,0xAA,0xAA,0xAA,0xAA,0xAA};
  uint8_t ucValid [EE_HEADER_ELEMENT_SIZE]   = {0xAA,0xAA,0xAA,0xAA,0xAA,0xAA,0xAA,0xAA};
  uint8_t ucErasing [EE_HEADER_ELEMENT_SIZE] = {0xAA,0xAA,0xAA,0xAA,0xAA,0xAA,0xAA,0xAA};

  uint32_t ulHeader1 = PAGE_ADDRESS(Page);
  uint32_t ulHeader2 = PAGE_ADDRESS(Page) + EE_HEADER_ELEMENT_SIZE;
  uint32_t ulHeader3 = PAGE_ADDRESS(Page) + (EE_HEADER_ELEMENT_SIZE*2U);
  uint32_t ulHeader4 = PAGE_ADDRESS(Page) + (EE_HEADER_ELEMENT_SIZE*3U);

  switch(State)
  {
		case STATE_PAGE_RECEIVE:
		{
		/* Set new Page status to STATE_PAGE_RECEIVE status */
			if (xFI_Write((ulHeader1), ucReceive,EE_HEADER_ELEMENT_SIZE)!= HAL_OK)
			{
				return EE_WRITE_ERROR;
			}
			ucCurrentActivePage = Page;
		}
		break;
		case STATE_PAGE_ACTIVE:
		{
			/* Set new Page status to STATE_PAGE_ACTIVE status */
			if (xFI_Write((ulHeader2), ucActive,EE_HEADER_ELEMENT_SIZE)!= HAL_OK)
			{
				return EE_WRITE_ERROR;
			}
			ucCurrentActivePage = Page;
		}
		break;

		case STATE_PAGE_VALID:
		{
			/* Set new Page status to STATE_PAGE_VALID status */
			if (xFI_Write((ulHeader3), ucValid,EE_HEADER_ELEMENT_SIZE)!= HAL_OK)
			{
				return EE_WRITE_ERROR;
			}
		}
		break;

		case STATE_PAGE_ERASING:
		{
			/* Set new Page status to STATE_PAGE_ERASING status */
			if (xFI_Write((ulHeader4), ucErasing,EE_HEADER_ELEMENT_SIZE)!= HAL_OK)
			{
				return EE_WRITE_ERROR;
			}
		}
		break;
		default: 
		break;
  }
  /* Return last operation flash status */
  return EE_OK;
}


/**
  * @brief  Erase group of pages which are erasing state.
  *         Could be either first half or second half of total pages number.
  * @retval EE_Status
  *           - EE_OK: in case of success
  *           - EE error code: if an error occurs
  */
EE_Status prvEE_CleanUp(void)
{
  uint32_t ulFirstPage = 0U;
  uint32_t ulPage = 0U;
  uint32_t ulFirstPageAddress = 0U;
  uint32_t ulPageAddress = 0U;
  EE_State_type firstpagestatus = STATE_PAGE_INVALID, pagestatus = STATE_PAGE_INVALID;

  /* Check first half and second half page group */
  for (ulFirstPage = START_PAGE; ulFirstPage < (START_PAGE + PAGES_NUMBER); ulFirstPage += PAGE_GROUP)
  	{
		/* Check status of first page of the group */
		ulFirstPageAddress = PAGE_ADDRESS(ulFirstPage);
		firstpagestatus = prvGetPageState(ulFirstPageAddress);

		/* If first page of the group is erasing state, check that all other pages
		of the group are also erasing state */
		if (firstpagestatus == STATE_PAGE_ERASING)
		{
			for (ulPage = (ulFirstPage + 1U); ulPage < (ulFirstPage + PAGE_GROUP); ulPage++)
			{
				ulPageAddress = PAGE_ADDRESS(ulPage);
				pagestatus = prvGetPageState(ulPageAddress);

