kurella-saikumar/eStar_InstrumentCluster/eStar_Cluster_Demo/STM32CubeIDE/Application/User/Core/src/Service/Memory_Service/eeprom_emul/eeprom_emulation/eeprom_emul.c
  /* Get currentpage status */
  ulCurrentPage = ucCurrentActivePage;
  currentpagestatus = prvGetPageState(PAGE_ADDRESS(ulCurrentPage));

  /* Get followingpage status */
  ulFollowingPage = FOLLOWING_PAGE(ulCurrentPage);
  followingpagestatus = prvGetPageState(PAGE_ADDRESS(ulFollowingPage));

  /* Get previouspage status */
  ulPreviousPage = PREVIOUS_PAGE(ulCurrentPage);

  /* Write, read or erase operation */
  switch (Operation)
	{
		case FIND_WRITE_PAGE:   /* ---- Write operation ---- */

			/* Normal operation, no page transfer on going */
			if (currentpagestatus == STATE_PAGE_ACTIVE)
			{
				/* Check if active page is not full */
				if (ulAddressNextWrite < (PAGE_SIZE - EE_ELEMENT_SIZE))
				{
					/* Return current Active page */
#if(EMUL_DEBUG_ENABLE == 1)
//					printf("Writing in %ld Page (Current)\n\r", ulCurrentPage);
#endif
					return ulCurrentPage;
				}
				else
				/* No more space in current active page */
				{
#if(EMUL_DEBUG_ENABLE == 1)
//					printf("Writing in %ld Page (Following) \n\r", ulFollowingPage);
#endif
					/* Check if following page is erasing state */
					if (followingpagestatus == STATE_PAGE_ERASING)
					{
						/* Force Cleanup, as not yet performed by user */
						if (prvEE_CleanUp() != EE_OK)
						{
							return EE_NO_PAGE_FOUND;
						}
					}

					/* Set current active page in valid state */
					if (prvSetPageState(ulCurrentPage, STATE_PAGE_VALID) != EE_OK)
					{
						return EE_NO_PAGE_FOUND;
					}

					/* Set following page as active */
					if (prvSetPageState(ulFollowingPage, STATE_PAGE_ACTIVE) != EE_OK)
					{
						return EE_NO_PAGE_FOUND;
					}
					ulAddressNextWrite = PAGE_HEADER_SIZE;   /* Skip page header */
					return ulFollowingPage;         /* Following page is now active one */
				}
			}
			/* Transfer is on going, page receiving data */
			else
			{
				if (currentpagestatus == STATE_PAGE_RECEIVE)
				{
					/* Check if receive page is not full */
					if (ulAddressNextWrite < PAGE_SIZE)
					{
						/* Return current receive page */
						return ulCurrentPage;
					}
					else
					/* No more space in current receive page */
					{
						/* Check if following page is erasing state */
						if (followingpagestatus == STATE_PAGE_ERASING)
						{
							/* Force Cleanup, as not yet performed by user */
							if (prvEE_CleanUp() != EE_OK)
							{
								return EE_NO_PAGE_FOUND;
							}
						}

						/* Set current receive page in valid state */
						if (prvSetPageState(ulCurrentPage, STATE_PAGE_VALID) != EE_OK)
						{
							return EE_NO_PAGE_FOUND;
						}

						/* Set following page as receive */
						if (prvSetPageState(ulFollowingPage, STATE_PAGE_RECEIVE) != EE_OK)
						{
							return EE_NO_PAGE_FOUND;
						}
						ulAddressNextWrite = PAGE_HEADER_SIZE;   /* Skip page header */
						return ulFollowingPage;         /* Following page is now active one */
					}
				}
				else
				{
				return EE_NO_PAGE_FOUND;   /* No active Page */
				}
			}

		case FIND_READ_PAGE:  /* ---- Read operation ---- */

			if (currentpagestatus == STATE_PAGE_ACTIVE)
			{
				return ulCurrentPage;
			}
			else
			{
				if (currentpagestatus == STATE_PAGE_RECEIVE)
				{
					return ulPreviousPage;
				}
				else
				{
					return EE_NO_PAGE_FOUND;   /* No active Page */
				}
			}

		case FIND_ERASE_PAGE: /* ---- Return the erased page */

			if (followingpagestatus == STATE_PAGE_ERASED)
			{
				return ulFollowingPage;
			}
			else
			{
				return EE_NO_PAGE_FOUND;  /* No erased Page */
			}

		default:
		;
  	}
  return EE_NO_PAGE_FOUND;
}

/**
  * @brief  Verify if pages are full
  *   then if not the case, writes variable in EEPROM.
  * @param  VirtAddress 16 bit virtual address of the variable
  * @param  Data @ref EE_DATA_TYPE data to be written as variable value
  * @param  Write_type Type of writing on going (see EE_Write_type)
  * @retval EE_Status
  *           - EE_OK: on success
  *           - EE_FULL: if half pages are full
  *           - EE_FLASH_USED: flash currently used by CPU2
  *           - EE error code: if an error occurs
  */

EE_Status prvVerifyPagesFullWriteVariable(uint32_t VirtAddress, EE_DATA_TYPE Data)
{

	/* Check if pages are full, i.e. max number of written elements achieved */
	if (usNbWrittenElements >= NB_MAX_WRITTEN_ELEMENTS)
	{
	return EE_PAGE_FULL;
	}

	/* Get active Page for write operation */
	uint32_t activepage = prvFindPage(FIND_WRITE_PAGE);
	uint32_t activepageaddress = 0U;

	/* Check if there is no active page */
	if (activepage == EE_NO_PAGE_FOUND)
	{
		return EE_ERROR_NOACTIVE_PAGE;
	}

	activepageaddress = PAGE_ADDRESS(activepage);

	uint8_t ucDataArray[EE_ELEMENT_SIZE] = {0x00};
	ucDataArray[0] = (VirtAddress >> 24) & 0xFF,        // Least significant byte
	ucDataArray[1] = (VirtAddress >> 16) & 0xFF;
	ucDataArray[2] = (VirtAddress >> 8) & 0xFF;
	ucDataArray[3] = VirtAddress & 0xFF;
	ucDataArray[4] = (Data >> 24) & 0xFF;
	ucDataArray[5] = (Data >> 16) & 0xFF;
	ucDataArray[6] = (Data >> 8) & 0xFF;
	ucDataArray[7] = Data & 0xFF;

	/*calculate CRC */
	uint16_t usCRC = 0;
	usCRC = xCrc16BitPolinomial_1021(&ucDataArray[4],4,0);

	ucDataArray[8] = (usCRC >> 8) & 0xFF;
	ucDataArray[9] =  usCRC & 0xFF;       // Most significant byte

	/* Program variable data, virtual address,and CRC*/
	/* If program operation was failed, a Flash error code is returned */
	if(xFI_Write(activepageaddress+ulAddressNextWrite, ucDataArray, EE_ELEMENT_SIZE)!= HAL_OK)
	{
		return HAL_ERROR;
	}
	/* Increment global variables relative to write operation done*/
	ulAddressNextWrite += EE_ELEMENT_SIZE;
	usNbWrittenElements++;
#if(EMUL_DEBUG_ENABLE == 1)
//	printf( "usNbWrittenElements=%d\n\r",usNbWrittenElements);
//	printf( "ucCurrentActivePage=%d\n\r",ucCurrentActivePage);
//	printf( "ulAddressNextWrite=%lu\n\r",ulAddressNextWrite);
#endif
	return EE_OK;
}

/**
  * @brief  Writes a new variable data in fresh new page in case of normal
  *         transfer, and transfers last updated elements from full pages to
  *         empty pages in any cases.
  * @param  VirtAddress 16 bit virtual address of the new variable data
  * @param  Data @ref EE_DATA_TYPE data value of the new variable data
  * @param  Type Type of transfer.
  *         This parameter can be one of the EE_Transfer_type enum values.
  *            @arg @ref EE_TRANSFER_NORMAL Pages transfer during normal processing
  *            @arg @ref EE_TRANSFER_RECOVER Recovering pages transfer at Init
  * @retval EE_Status
  *           - prvEE_CleanUp_REQUIRED: on success
  *           - EE error code: if an error occurs
  */

EE_Status prvPagesTransfer (uint32_t VirtAddress, EE_DATA_TYPE Data, EE_Transfer_type Type)
{
	EE_State_type pagestatus = STATE_PAGE_INVALID;
	uint32_t ulPageAddress = 0U;
	uint32_t ulPage = 0U;
	uint32_t ulVarIdx = 0U;
	EE_ELEMENT_TYPE addressvalue = 0U;
	EE_Status status = EE_OK;
	EE_DATA_TYPE DataValue = 0U;
	uint8_t ucReadData[EE_ELEMENT_SIZE]={0};

