kurella-saikumar/eStar_InstrumentCluster/eStar_Cluster_Demo/STM32CubeIDE/Application/User/Core/src/Service/Memory_Service/eeprom_emul/eeprom_emulation/eeprom_emul.c
	/* Get receive Page for transfer operation */
	ulPage = prvFindPage((Type == EE_TRANSFER_NORMAL?FIND_ERASE_PAGE:FIND_WRITE_PAGE));

	if (ulPage == EE_NO_PAGE_FOUND)
	{
	  return EE_ERROR_NOERASE_PAGE;
	}

	/* Reinitialize number of data written in the pages, and current active page */
	usNbWrittenElements = 0U;
	ucCurrentActivePage = ulPage;
	ulAddressNextWrite = PAGE_HEADER_SIZE;

	/* Mark the erased page at receive state in case of normal transfer */
	/* It is already the case in recover transfer case */
	/* If program operation was failed, a Flash error code is returned */
    if (Type == EE_TRANSFER_NORMAL)
    {
      if (prvSetPageState(ulPage, STATE_PAGE_RECEIVE) != EE_OK)
      {
        return EE_WRITE_ERROR;
      }
    }

	/* Set the previous active page and all previous valid pages to erasing state */
	/* In case of recover transfer, some of these pages may already be marked erasing */
	ulPage = PREVIOUS_PAGE(ulPage);
	ulPageAddress = PAGE_ADDRESS(ulPage);
	pagestatus = prvGetPageState(ulPageAddress);

	if ((pagestatus == STATE_PAGE_ACTIVE) || (pagestatus == STATE_PAGE_ERASING))
	{
		/* Set active page to erasing */
		if (pagestatus == STATE_PAGE_ACTIVE)
		{
			if (prvSetPageState(ulPage, STATE_PAGE_ERASING) != EE_OK)
			{
				return EE_WRITE_ERROR;
			}
		}

		/* Inspect the previous pages to set all valid pages to erasing state */
		/* In case of recover, some valid pages may be already erasing state */
		ulPage = PREVIOUS_PAGE(ulPage);
		ulPageAddress = PAGE_ADDRESS(ulPage);
		pagestatus = prvGetPageState(ulPageAddress);

		while ((pagestatus == STATE_PAGE_VALID) || (pagestatus == STATE_PAGE_ERASING))
		{
			/* Set valid page to erasing */
			if (pagestatus == STATE_PAGE_VALID)
			{
				if (prvSetPageState(ulPage, STATE_PAGE_ERASING) != EE_OK)
				{
					return EE_WRITE_ERROR;
				}
			}

			/* decrement page index */
			ulPage = PREVIOUS_PAGE(ulPage);
			ulPageAddress = PAGE_ADDRESS(ulPage);
			pagestatus = prvGetPageState(ulPageAddress);
		}
	}
    else
    {
		if ((Type == EE_TRANSFER_RECOVER) && (pagestatus == STATE_PAGE_VALID))
		{
			/* This can happen in case of recover transfer. It indicates that previous */
			/* transfer goes far enough to fill a complete receive page at least */
			/* (valid state). Then erasing state marking was already completed */
		}
		else
		{
			/* Inconsistent previous page state */
			return EE_INVALID_PAGE_SEQUENCE;
		}
    }
	/* In case of recover transfer, transfer must be resumed where it has been stopped */
	/* Update global variables to reflect current transfer status */
	if (Type == EE_TRANSFER_RECOVER)
	{
		/* Count number of elements already transferred in current receive page */
		for (ulVarIdx = PAGE_HEADER_SIZE; ulVarIdx < PAGE_SIZE; ulVarIdx += EE_ELEMENT_SIZE)
		{
			/* Get next element in receive page */
			xFI_Read(((PAGE_ADDRESS(ucCurrentActivePage)) + ulVarIdx), ucReadData,EE_ELEMENT_SIZE);

			for (int i = (EE_HEADER_ELEMENT_SIZE-1); i >=0; i--)
			{
				addressvalue |= ((uint64_t)ucReadData[i]<< (8 * i)); // Add the byte from DataValue
			}
			uint16_t usCRCBytes = (ucReadData[8]<<8|ucReadData[9]);

			if ((addressvalue != EE_PAGESTAT_ERASED)&&(usCRCBytes != 0xFFFFU))
			{
				/* Update global variables accordingly */
				usNbWrittenElements++;
				ulAddressNextWrite += EE_ELEMENT_SIZE;
			}
			else
			{
				break;
			}
		}
		/* Count number of elements already transferred in previous valid pages */
		ulPage = ucCurrentActivePage;
		for (ulVarIdx = 0U; ulVarIdx < PAGES_NUMBER; ulVarIdx++)
		{
			/* Decrement page index among circular pages list */
			ulPage = PREVIOUS_PAGE(ulPage);
			pagestatus = prvGetPageState(PAGE_ADDRESS(ulPage));

			/* Check if page is valid state */
			if (pagestatus == STATE_PAGE_VALID)
			{
				/* Update usNbWrittenElements with number of elements in page */
				usNbWrittenElements += NB_MAX_ELEMENTS_BY_PAGE;
			}
			else
			{
				break;
			}
		}
	}
	// Write the variable passed as parameter in the new active page
	// If program operation was failed, a Flash error code is returned
	if (prvVerifyPagesFullWriteVariable(VirtAddress, Data) != EE_OK)
	{
		return EE_WRITE_ERROR;
	}
	/* Transfer process: transfer variables from old to the new active page */
	/* First element in receive page can be any one, the following elements are */
	/* ordered from the beginning. */
	/* In case of recovery, Pre-Last element in receive page could be */
	/* corrupted if reset occured during write of this element, */
	/* and last element is dummy value that we have just written. */
	/* Transfer shall then resume from (usNbWrittenElements-3) variable index */

	for (ulVarIdx = 0U; ulVarIdx < (uint32_t)(sizeof((void*)eepromVariables) / sizeof((void*)eepromVariables[0])); ulVarIdx++)
	{
        /* Check each variable except the one passed as parameter */
		if ((uint32_t)eepromVariables[ulVarIdx] !=VirtAddress)
		{
			/* Read the last variable updates */
			status = prvReadVariable((uint32_t)eepromVariables[ulVarIdx], &DataValue);

			if (status == EE_OK)
			{
				/* In case variable corresponding to the virtual address was found */
				/* Transfer the variable to the new active page */
				/* If program operation was failed, a Flash error code is returned */
				status = prvVerifyPagesFullWriteVariable((uint32_t)eepromVariables[ulVarIdx], DataValue);

				if (status != EE_OK)
				{
					return status;
				}
			}
	 		else
			{
				if (status != EE_NO_DATA)
				{
					/* In case variable is not found , do nothing */
					/* Any other status is error code occurs during variable read */
					return status;
				}
			}
	    }
    }

	/* Transfer is now done, mark the receive state page as active */
	if (prvSetPageState(ucCurrentActivePage, STATE_PAGE_ACTIVE) != EE_OK)
	{
	 	return EE_WRITE_ERROR;
	}
	/* Return last operation flash status */
	if (EE_OK != prvEE_CleanUp())
	{
		return EE_ERROR_NOERASING_PAGE ;
	}
	else
	{
		return EE_OK ;
	}
}

/**
  * @brief  Restore the pages to a known good state in case of page's status
  *   corruption after a power loss.
  * @param  None.
  * @retval - Flash error code: on write Flash error
  *         - FLASH_COMPLETE: on success
  */

EE_Status xEE_Init(EE_Erase_type EraseType)
{
//    HAL_GPIO_TogglePin(GPIOF, GPIO_PIN_9);
    EE_State_type pagestatus = STATE_PAGE_INVALID;
    uint32_t ulPage = 0U;
    uint32_t ulPageAddress = 0U;
    uint32_t ulVarIdx = 0U;
    uint32_t ulNbActivePage = 0U;
    uint32_t ulNbActiveReceivePage = 0U;
    uint32_t ulNbValidPage = 0U;
    uint32_t ulLastValidPage = 0U;
    uint32_t ulFirstValidPage = 0U;
    EE_State_Reliability pagestate = STATE_RELIABLE;

    //Flash interface (peripheral init) shall be done before eeprom read/write operation start
    vFI_Init();

    // Cache page states
    EE_State_type pageStates[PAGES_NUMBER];
    for (ulPage = START_PAGE; ulPage < (START_PAGE + PAGES_NUMBER); ulPage++)
    {
        ulPageAddress = PAGE_ADDRESS(ulPage);
        pageStates[ulPage - START_PAGE] = prvGetPageState(ulPageAddress);
    }

    // Check the flash end address with calculated end address for required variables
    if (CALCULATED_END_ADDRESS >= FLASH_END_ADDR)
    {
        return EE_MEMORY_NOT_SUFFICIENT;
    }

    /***************************************************************************/
    /* Step 1: Handle case of reset during transfer with no receive page       */
    /*         present, by setting missing receive page state                  */
    /***************************************************************************/

    for (ulPage = START_PAGE; ulPage < (START_PAGE + PAGES_NUMBER); ulPage++)
    {
        pagestatus = pageStates[ulPage - START_PAGE];

        if ((pagestatus == STATE_PAGE_ACTIVE) || (pagestatus == STATE_PAGE_RECEIVE))
        {
            ulNbActiveReceivePage++;
        }
        else if (pagestatus == STATE_PAGE_VALID)
        {
            if (ulNbValidPage == 0U)
            {
                ulFirstValidPage = ulPage;
            }
            ulLastValidPage = ulPage;
            ulNbValidPage++;
        }
    }

    if (ulNbActiveReceivePage == 0U)
    {
        if (ulNbValidPage > 0U)
        {
            if (pageStates[PREVIOUS_PAGE(ulFirstValidPage) - START_PAGE] == STATE_PAGE_ERASING)
            {
                if (prvSetPageState(FOLLOWING_PAGE(ulLastValidPage), STATE_PAGE_RECEIVE) != EE_OK)
                {
                    return EE_WRITE_ERROR;
                }
            }
        }
        else
        {
            return prvEE_Format(EE_FORCED_ERASE);
        }
    }

    /*********************************************************************/
    /* Step 2: Handle case of reset during transfer, by performing       */
    /*         transfer recovery                                         */
    /*********************************************************************/

    for (ulPage = START_PAGE; ulPage < (START_PAGE + PAGES_NUMBER); ulPage++)
    {
        pagestatus = pageStates[ulPage - START_PAGE];

        if (pagestatus == STATE_PAGE_RECEIVE)
        {
            if ((ulPage != START_PAGE) && (ulPage != (uint32_t)(START_PAGE + PAGE_GROUP)))
            {
                if (pageStates[PREVIOUS_PAGE(ulPage) - START_PAGE] == STATE_PAGE_VALID)
                {
                    pagestate = STATE_RELIABLE;
                }
                else
                {
                    pagestate = STATE_CORRUPTED;
                }
            }
            else
            {
                if (pageStates[FOLLOWING_PAGE(ulPage) - START_PAGE] == STATE_PAGE_ERASED)
                {
                    pagestate = STATE_RELIABLE;
                }
                else
                {
                    pagestate = STATE_CORRUPTED;
                }
            }

            if (pagestate == STATE_RELIABLE)
            {
                ucCurrentActivePage = ulPage;
                if (prvPagesTransfer(0U, 0U, EE_TRANSFER_RECOVER) != EE_CLEANUP_REQUIRED)
                {
                    return EE_TRANSFER_ERROR;
                }
                break;
            }
        }
    }

    /*********************************************************************/
    /* Step 3: Verify presence of one unique active page                 */
    /*         If more than one active page, raise error                 */
    /*         If no active page present, set missing active page        */
    /*********************************************************************/

    ulNbActivePage = 0U;
    for (ulPage = START_PAGE; ulPage < (START_PAGE + PAGES_NUMBER); ulPage++)
    {
        pagestatus = pageStates[ulPage - START_PAGE];

        if (pagestatus == STATE_PAGE_ACTIVE) {
            if ((ulPage != START_PAGE) && (ulPage != (uint32_t)(START_PAGE + PAGE_GROUP)))
            {
                if (pageStates[PREVIOUS_PAGE(ulPage) - START_PAGE] == STATE_PAGE_VALID)
                {
                    pagestate = STATE_RELIABLE;
                }
                else
                {
                    pagestate = STATE_CORRUPTED;
                }
            }
            else
            {
                if (pageStates[FOLLOWING_PAGE(ulPage) - START_PAGE] == STATE_PAGE_ERASED)
                {
                    pagestate = STATE_RELIABLE;
                }
                else
                {
                    pagestate = STATE_CORRUPTED;
                }
            }

            if (pagestate == STATE_RELIABLE)
            {
                if (ulNbActivePage == 0U)
                {
                    ucCurrentActivePage = ulPage;
                    ulNbActivePage++;
                }
                else
                {
                    return EE_INVALID_PAGE_SEQUENCE;
                }
            }
        }
        else if (pagestatus == STATE_PAGE_VALID)
        {
            ulLastValidPage = ulPage;
        }
    }

    if (ulNbActivePage == 0U)
    {
        ucCurrentActivePage = FOLLOWING_PAGE(ulLastValidPage);
        if (prvSetPageState(ucCurrentActivePage, STATE_PAGE_ACTIVE) != EE_OK)
        {
            return EE_WRITE_ERROR;
        }
    }

    /*********************************************************************/
    /* Step 4: Initialize eeprom emulation global variables relative     */
    /*         to active page                                            */
    /*********************************************************************/

