kurella-saikumar/eStar_InstrumentCluster/eStar_Cluster_Demo/STM32CubeIDE/Application/User/Core/src/Service/Memory_Service/eeprom_emul/eeprom_emulation/eeprom_emul.c
    usNbWrittenElements = 0U;
    ulAddressNextWrite = PAGE_HEADER_SIZE;
    for (ulVarIdx = PAGE_HEADER_SIZE; ulVarIdx < (PAGE_SIZE); ulVarIdx += EE_ELEMENT_SIZE)
    {
        uint32_t ulDataValue;
        uint32_t ulReadAddressValue;
        uint16_t usCRC;
        uint8_t ucReadData[EE_ELEMENT_SIZE] = {0x00};

        xFI_Read(((PAGE_ADDRESS(ucCurrentActivePage)) + ulVarIdx), ucReadData, EE_ELEMENT_SIZE);

        ulDataValue = (ucReadData[0] << 24 | ucReadData[1] << 16 | ucReadData[2] << 8 | ucReadData[3]);
        ulReadAddressValue = (ucReadData[4] << 24 | ucReadData[5] << 16 | ucReadData[6] << 8 | ucReadData[7]);
        usCRC = (ucReadData[8] << 8 | ucReadData[9]);

        if ((ulDataValue != EE_NO_DATA_FOUND) && (ulReadAddressValue != EE_NO_DATA_FOUND) && (usCRC != 0xFFFFU))
        {
            usNbWrittenElements++;
            ulAddressNextWrite += EE_ELEMENT_SIZE;
        }
        else
        {
            break;
        }
    }

    /*********************************************************************/
    /* Step 5: Finalize eeprom emulation global variables relative       */
    /*         to valid pages, and check consistency of pages sequence   */
    /*********************************************************************/

    ulPage = ucCurrentActivePage;
    ulFirstValidPage = ucCurrentActivePage;
    while ((ulPage != START_PAGE) && (ulPage != (uint32_t)(START_PAGE + PAGE_GROUP)))
    {
        ulPage = PREVIOUS_PAGE(ulPage);
        pagestatus = pageStates[ulPage - START_PAGE];

        if (pagestatus == STATE_PAGE_VALID)
        {
            usNbWrittenElements += NB_MAX_ELEMENTS_BY_PAGE;
            ulFirstValidPage = ulPage;
        }
        else
        {
            return EE_INVALID_PAGE_SEQUENCE;
        }
    }

    /*********************************************************************/
    /* Step 6: Ensure empty pages are erased                             */
    /*********************************************************************/
    // retrieve page states
    for (ulPage = 0; ulPage < PAGES_NUMBER; ulPage++)
    {
        ulPageAddress = PAGE_ADDRESS(ulPage);
        pageStates[ulPage] = prvGetPageState(ulPageAddress);
        if ((pageStates[ulPage] == STATE_PAGE_ERASED))
        {
            if (prvVerifyPageFullyErased(ulPageAddress, PAGE_SIZE) == EE_PAGE_NOTERASED)
            {
                if (xFI_PageErase((ulPageAddress)) != EE_OK)
                {
                    return EE_ERASE_ERROR;
                }
                else
                {
                	/*Do Nothing*/
                }
            }
            else
            {
            	/*Do Nothing*/
            }
        }
        else
        {
        	/*Do Nothing*/
        }
    }

#if(EMUL_DEBUG_ENABLE == 1)
//	printf( "usNbWrittenElements=%d\n\r",usNbWrittenElements);
//	printf( "ucCurrentActivePage=%d\n\r",ucCurrentActivePage);
//	printf( "ulAddressNextWrite=%lu\n\r",ulAddressNextWrite);
#endif
    vShadowRAM_Init();
//    HAL_GPIO_TogglePin(GPIOF, GPIO_PIN_9);
    return EE_OK;

}
uint32_t xShadowUpdate(void)
 {
 	uint32_t ulPage = 0U;
 	uint32_t ulPageAddress = 0U;
 	uint32_t ulCounter = 0U;
 	volatile uint32_t ulReadAddr = 0;
 	volatile uint32_t ulData = 0;
 	uint16_t usCRCRead = 0;
 	uint16_t usCRCCalculated = 0;
	uint8_t ucReadData[EE_ELEMENT_SIZE] = {0x00};

 	 EE_State_type pagestate = STATE_PAGE_INVALID;

 	 /* Get active Page for read operation */
 	 ulPage = prvFindPage(FIND_READ_PAGE);

 	 /* Check if there is no active page */
 	 if (ulPage == EE_NO_PAGE_FOUND)
 	 {
 		return EE_ERROR_NOACTIVE_PAGE;
 	 }
 	 ulPageAddress = PAGE_ADDRESS(ulPage);
 	 pagestate = prvGetPageState(ulPageAddress);

 	 /* Search variable in active page and valid pages until erased page is found
 		or in erasing pages until erased page is found */

 	 if (pagestate == STATE_PAGE_ACTIVE)
 	 {
 		/* Set counter index to last element position in the page */
 		ulCounter = PAGE_HEADER_SIZE ;

		while (ulCounter <= PAGE_SIZE - EMPTY_BYTES_FOR_PAGE)
 		{
 			/* Get the current location content to be compared with virtual address */

			xFI_Read(ulPageAddress + ulCounter,ucReadData,EE_ELEMENT_SIZE);

			ulReadAddr = (ucReadData[0]<<24|ucReadData[1]<<16|ucReadData[2]<<8|ucReadData[3]);
 			if (ulReadAddr != 0xFFFFFFFFU)
 			{
				ulData = (ucReadData[4]<<24|ucReadData[5]<<16|ucReadData[6]<<8|ucReadData[7]);
 				usCRCCalculated = xCrc16BitPolinomial_1021(&ucReadData[4],4,0);

 				usCRCRead = (ucReadData[8]<<8|ucReadData[9]);
 				if (usCRCCalculated == usCRCRead)
 				{
					memcpy((void *)ulReadAddr,(const void *) &ulData, sizeof(ulData));
#if(EMUL_DEBUG_ENABLE == 1)
					printf("ESR_S:Data = 0x%lx\t,VAdr = 0x%lx\t,CRC= 0x%x\n",ulData,ulReadAddr,usCRCRead);
#endif
 				}
 				else
 				{
 					return EE_READ_DATA_INVALID;
 				}
 			}
			else
			{
				/*do nothing*/
			}
 			/* Next address location */
 			ulCounter += EE_ELEMENT_SIZE;
 		}
		}
 	 return EE_OK;
 }

 /**
   * @brief  Initializes the shadowRAM with default values of variables
   * 		and update with last saved values in eeprom.
   * @param  None.
   * @retval None
   */


 void vShadowRAM_Init(void)
 {
 	/* Write default values into eep_Variables_t */
 	memcpy(&eep_Variables_t, &eep_default_t, sizeof(eepromData_t));

 	xShadowUpdate();

 }

 /**
   * @brief  Write Variables in EEPROM and ShadowRAM.
   * @param  VirtAddress Variable name to be write
   * @param  Data Data to be write
   * @param  UpdateToShadowRAM update data into shadowRAM
   * @retval Status of the operation of during EEPROM write
   */

 uint16_t xES_WriteVariable(uint32_t VirtAddress, uint32_t Data,uint32_t *UpdateToShadowRAM)
 {
	if(*UpdateToShadowRAM != Data)
	{
#if(EMUL_DEBUG_ENABLE == 0)
		printf("SHRAM:%ld,Data:%ld\n",*UpdateToShadowRAM,Data);
#endif
		if (BSP_ERROR_NONE == xEE_WriteVariable32bits(VirtAddress, Data)) //Write into EEPROM
		{
			*UpdateToShadowRAM = Data;
		}
		else
		{
			return BSP_ERROR_COMPONENT_FAILURE;
		}
	}
	return BSP_ERROR_NONE;
 }
/**************************************************************************************************
 * End Of File
***************************************************************************************************/
